Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetPolyloop
Gets the planar polygon describing the opening geometry.
Remarks:
A planar polygon describing the surface geometry as described
in gbXML. The geometry is currently measured per analytical(center-line).
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetAnalyticalSurface
Gets the associative analytical parent surface element.
Returns:
The associative analytical parent surface element.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OpeningId
The unique identifier for the opening.
Remarks:
This identification attribute is composed of the id for the
parent surface, the prefix "op" and a sequential number, all
separated by "-". A sample value would be "su-1-op-1".
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OriginatingElementDescription
The description for the originating Revit element.
Remarks:
Surface and Opening elements get an CADObjectId element assigned
according to the below described schema, based on associative
room bounding element:
(Family Name): (Family Type)[Element Id]
Sample:
System Panel: System Panel [50566]
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.Corner
The lower-left coordinate for the analytical rectangular geometry viewed from outside.
Remarks:
A planar polygon describing the surface geometry as described
in gbXML. The geometry is currently measured per analytical(center-line).
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OpeningType
The analytical opening type.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.CADLinkUniqueId
The unique id of the originating CAD object's link (linked document) associated with this opening.
Remarks:
This id can be passed to obtain the element from Document.Element[string] property, but any link obtained through this method
may no longer be a valid or up-to-date link. The originating CAD link is only accurate and up-to-date at the time of creation of the energy model.
An empty string is returned if the originating CAD object is not hosted in a linked document.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.CADObjectUniqueId
The unique id of the originating CAD object (model element) associated with this opening.
Remarks:
This id can be passed to obtain the element from Document.Element[string] property, but any element obtained through this method
may no longer be a valid or up-to-date model element. The originating CAD object is only accurate and up-to-date at the time of creation of the energy model.
If the originating element belongs to a linked document, the unique id of the link obtained from CADLinkUniqueId should be used to access it.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.OpeningName
The unique name identifier for the opening.
Remarks:
Surface and Opening elements get an Name element assigned
according to the below described schema:
(Orientation)(Space#)[(Other space#)](Exposure)(Type)-(sequence number)[Opening Type+#]
Sample:
N-101-102-E-W-O-77
N = Orientation [N/NE/E/SE/S/SW/W/NW/N/T/B/X]
(every surface within the sector of 22.5 degrees from the north
vector gets the letter N etc) (horizontal surfaces facing upwards
get the letter T for top, downwards B for bottom) (shading surfaces
get the letter X for differentiation).
101 = Space number.
102 = Other space number.
E = Exposure - exterior/interior/underground [E/I/U].
W = Type [W/C/R/F] (Wall, Roof, Ceiling, Floor, Shade) (every
surface type has it's letter W-Wall R-Roof C-Ceiling F-Floor S-Shade).
O = Opening Type [W/D/O] (Window, Door, Opening) (every opening
type has it's letter W-Window D-Door O-Opening).
77 = sequence number.
Sample surface names:
N-101-E-W-84 North facing Exterior Wall #84 in space 101.
N-101-E-W-84-D-1 Door #1 in North facing Exterior Wall #84 in space 101.
E-101-102-I-W-92 Vertical Interior Wall #92 between space 101 and 102.
T-101-E-R-141 Top facing Exterior Roof #141 in space 101.
B-101-201-I-F-88 Bottom facing Interior Floor #88 between space 101 and 201.
X-73 Shade #73.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.Type
The gbXML opening type attribute.
Remarks:
The type of the opening is based on the family category for
the opening and in what element it is contained in:
If it is a Window it will have a type of OperableWindow. If it is a Door it will have a type of NonSlidingDoor. If the opening is contained in a Roof it will have a type of FixedSkylight. If it is a Curtain Wall Panel, the opening will default to
a type of FixedWindow. If the material specified for the family,
and the material transparency is less than 3%, the opening will
be ignored as a solid panel.
An opening of the category Openings will have the type of Air.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.Height
The height of the analytical rectangular geometry.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.Width
The width of the analytical rectangular geometry.
Remarks:
The product of width and height should be equal to the area
of the polyloop for the opening. The width is adjusted to accomplish this.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening
Analytical opening.
Since:
2012